WMO_CODES = {
    0: {
        "en": ("Clear sky", "☀️"),
        "bg": ("Ясно небе", "☀️")
    },
    1: {
        "en": ("Mainly clear", "🌤️"),
        "bg": ("Предимно ясно", "🌤️")
    },
    2: {
        "en": ("Partly cloudy", "⛅"),
        "bg": ("Частична облачност", "⛅")
    },
    3: {
        "en": ("Overcast", "☁️"),
        "bg": ("Значителна облачност", "☁️")
    },
    45: {
        "en": ("Fog", "🌫️"),
        "bg": ("Мъгла", "🌫️")
    },
    48: {
        "en": ("Depositing rime fog", "🌫️"),
        "bg": ("Скрежна мъгла", "🌫️")
    },
    51: {
        "en": ("Drizzle: Light", "🌦️"),
        "bg": ("Ръмеж: Слаб", "🌦️")
    },
    53: {
        "en": ("Drizzle: Moderate", "🌦️"),
        "bg": ("Ръмеж: Умерен", "🌦️")
    },
    55: {
        "en": ("Drizzle: Dense", "🌦️"),
        "bg": ("Ръмеж: Плътен", "🌦️")
    },
    56: {
        "en": ("Freezing Drizzle: Light", "🌨️"),
        "bg": ("Леден ръмеж: Слаб", "🌨️")
    },
    57: {
        "en": ("Freezing Drizzle: Dense", "🌨️"),
        "bg": ("Леден ръмеж: Плътен", "🌨️")
    },
    61: {
        "en": ("Rain: Slight", "🌧️"),
        "bg": ("Дъжд: Слаб", "🌧️")
    },
    63: {
        "en": ("Rain: Moderate", "🌧️"),
        "bg": ("Дъжд: Умерен", "🌧️")
    },
    65: {
        "en": ("Heavy Rain", "🌧️"),
        "bg": ("Силен дъжд", "🌧️")
    },
    66: {
        "en": ("Freezing Rain: Light", "🌨️"),
        "bg": ("Леден дъжд: Слаб", "🌨️")
    },
    67: {
        "en": ("Heavy Freezing Rain", "🌨️"),
        "bg": ("Силен леден дъжд", "🌨️")
    },
    71: {
        "en": ("Snow fall: Slight", "❄️"),
        "bg": ("Снеговалеж: Слаб", "❄️")
    },
    73: {
        "en": ("Snow fall: Moderate", "❄️"),
        "bg": ("Снеговалеж: Умерен", "❄️")
    },
    75: {
        "en": ("Heavy Snow Fall", "❄️"),
        "bg": ("Силен снеговалеж", "❄️")
    },
    77: {
        "en": ("Snow grains", "❄️"),
        "bg": ("Снежни зърна", "❄️")
    },
    80: {
        "en": ("Rain showers: Slight", "🌦️"),
        "bg": ("Превалявания от дъжд: Слаби", "🌦️")
    },
    81: {
        "en": ("Rain showers: Moderate", "🌦️"),
        "bg": ("Превалявания от дъжд: Умерени", "🌦️")
    },
    82: {
        "en": ("Violent Rain Showers", "🌦️"),
        "bg": ("Проливни дъждове", "🌦️")
    },
    85: {
        "en": ("Snow showers: Slight", "🌨️"),
        "bg": ("Превалявания от сняг: Слаби", "🌨️")
    },
    86: {
        "en": ("Heavy Snow Showers", "🌨️"),
        "bg": ("Превалявания от сняг: Силни", "🌨️")
    },
    95: {
        "en": ("Thunderstorm", "⛈️"),
        "bg": ("Гръмотевична буря", "⛈️")
    },
    96: {
        "en": ("Thunderstorm with hail", "⛈️"),
        "bg": ("Гръмотевична буря с градушка", "⛈️")
    },
    99: {
        "en": ("Severe Thunderstorm", "⛈️"),
        "bg": ("Силна гръмотевична буря", "⛈️")
    },
}
